# Taps
tap "acsandmann/tap"
tap "appachitech/suvadu"
tap "nikitabobko/tap"

# CLI tools
brew "bat"
brew "btop"
brew "carapace"
brew "curl"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gnupg"
brew "go"
brew "k9s"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "pandoc"
brew "pinentry-mac"
brew "ripgrep"
brew "rust-analyzer"
brew "sesh"
brew "starship"
brew "stow"
brew "tmux"
brew "tree-sitter-cli"
brew "uv"
brew "yazi"
brew "zoxide"

# Zsh plugins
brew "fzf-tab"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"

# Custom taps
brew "acsandmann/tap/rift"
brew "appachitech/suvadu/suvadu"

# Tmux
brew "tpm"

# Casks
cask "aerospace"
cask "ghostty"
cask "font-sf-mono-nerd-font-ligaturized"
cask "obsidian"
cask "stats"
